{"pages":[{"title":"About SONANLEE","text":"I amMy CV(updated at Jan,2020) 8+ years of game development experience. Experiences with Unity, UnrealEngine Gameplay and Animation System Programmer Experience2018-Now,Unannounced Project, Prototyping Phase,Engineering Lead, Nexon Korea, Gyeonggi-do, Korea, 2019-2020,Mabinogi Mobile(Temporary support), Unity, Mobile MMORPG,Quest Team Lead(Temporary), Nexon Korea, Gyeonggi-do, Korea 2015-2018,Project Meta(Canceled), UE4, Multi-platform MO RPGGameplay Programmer, Nexon Korea, Gyeonggi-do, Korea. 2013-2015,Cabal 2, CryEngine 3, PC MMORPGClient Programmer, Estsoft, Seoul, Korea. 2012-2013,Inhouse Engine Team,Engine Programmer, Maiet Entertainment, Seoul, Korea. Favorite Quotes My brain is open.Paul Erdős (Mathematician) Don’t be a know-it-all; be a learn-it-all.Satya Nadella (Microsoft CEO) InterestsProgramming JavaScript Python C# Reactive Programming(Rx) Game Development Animation System ECS Unity Engine, Unreal Engine Software Architecture MVVM ReactiveUI Agile Development Data Oriented Design Mathematics Combinatorics Graph Theory Partition Theory Enumerative Combinatorics My Game Of The Year Every year, I pick and record my favorite game. 2019 - Brawl Stars (Mobile) 2018 - Destiny 2 (PC) 2017 - The Legend of Zelda: Breath of the Wild (Nintendo Switch) 2016 - Overwatch (PC) ArticlesDo-Haeng Lee, Won Hyoung Lee, Sung-Min Kang and Ho Young Hwang, “Frequency Allocation and Path Selection Scheme in Underlay Cognitive Radio Networks Using Network Coding”, The Journal of Korean Institute of Communications and Information Sciences, Vol. 40, pp.2372-2380. Dec. 2015 Do-Haeng Lee, Minseok Cheong and Sang-Mok Kim, “Some Reults on The Antibandwidth of k-ary Complete Trees of Height 3 for odd k”, Far East Journal of Mathematical Sciences, Vol. 70, Issue. 1, pp.121-134, Nov. 2012 D.-H. Lee, W. H. Lee, and H. Y. Hwang, “Network Coding-Based Relay Selection in Underlay Cognitive Radio Networks”, Proc. KICS Conf, pp. 352-353, Daejeon, Korea, Nov. 2014 Sang-Mok Kim, Do-Haeng Lee, Eol Choi, Mi-Sol Koh and Jae-Kyu Yang, “Estimation for the Variation of the Concentration of Greenhouse Gases with Modified Shannon Entropy”, Journal of Environmental Science International, Vol. 22, pp.1473-1479. Nov. 2013 D.-H. Lee, W. H. Lee, E. Choi, and H. Y.Hwang, “Subcarrier Allocation and Relay Selection for Uplink Transmission in OFDMA-Based Cognitive Radio Systems”, Proc. ICTC, pp. 485-487, Jeju, Korea, Oct. 2013 E. Choi, D.-H. Lee, M. Chen, and H. Y. Hwang, “Joint Resource Allocation and Path Selection in Network Coding-Based OFDMA Relay Networks”, Proc. ICUFN, pp. 780-784, Da Nang, Vietnam, Jul. 2013 D.-H. Lee, S.-M. Kim, “The Number of Isotones of Tightness 2 and 3”, Spring Meeting of the Korean Mathematical Society, p.68, Seoul, Korea, April. 2012 D.-H. Lee, S.-M. Kim, “Antibandwidth of Complete 3-ary Tree of Height 3”, Annual Meeting of the Korean Mathematical Society, p.114, Daegu, Korea, Oct. 2011","link":"/index.html"}],"posts":[],"tags":[],"categories":[]}