{"pages":[{"title":"About 소난","text":"저는,넥슨 데브캣에서 게임 프로그래머로 유니티로 재밌는 프로젝트를 하고 있습니다. 클라이언트 개발뿐만 아니라 서버 개발도 많은 관심을 갖고 있습니다.게임 개발 방법으로 애자일을 적극 도입하고 있고,게임을 개발할 때 있어 재미를 최우선 가치로 여깁니다.최근엔 조직 관리나 리더쉽 관련 분야에 관심을 많이 갖고 있습니다. 좋아하는 명언, My brain is open.Paul Erdős (Mathematician) Don’t be a know-it-all; be a learn-it-all.Satya Nadella (Microsoft CEO) 관심사Mathematics Combinatorics Graph Theory Partition Theory Enumerative Combinatorics Programming JavaScript Python C# Reactive Programming(Rx) Game Development Animation System ECS Unity Engine, Unreal Engine Software Architecture MVVM ReactiveUI Agile Development Data Oriented Design Game Of The Year 2016년부터 개인적으로 자주 플레이하고, 가장 좋아했던 게임을 선정합니다. 2019 - Brawl Stars (Mobile) 2018 - Destiny 2 (PC) 2017 - The Legend of Zelda: Breath of the Wild (Nintendo Switch) 2016 - Overwatch (PC) Articles대학생 때, 교수님들이랑 친하게 지내다가 쓰게 된 논문들입니다. 대학생 때 써본다고 열심히 쓰긴 했는데, 저의 부족한 실력 때문인지 SCI는 없습니다. Do-Haeng Lee, Won Hyoung Lee, Sung-Min Kang and Ho Young Hwang, “Frequency Allocation and Path Selection Scheme in Underlay Cognitive Radio Networks Using Network Coding”, The Journal of Korean Institute of Communications and Information Sciences, Vol. 40, pp.2372-2380. Dec. 2015 Do-Haeng Lee, Minseok Cheong and Sang-Mok Kim, “Some Reults on The Antibandwidth of k-ary Complete Trees of Height 3 for odd k”, Far East Journal of Mathematical Sciences, Vol. 70, Issue. 1, pp.121-134, Nov. 2012 D.-H. Lee, W. H. Lee, and H. Y. Hwang, “Network Coding-Based Relay Selection in Underlay Cognitive Radio Networks”, Proc. KICS Conf, pp. 352-353, Daejeon, Korea, Nov. 2014 Sang-Mok Kim, Do-Haeng Lee, Eol Choi, Mi-Sol Koh and Jae-Kyu Yang, “Estimation for the Variation of the Concentration of Greenhouse Gases with Modified Shannon Entropy”, Journal of Environmental Science International, Vol. 22, pp.1473-1479. Nov. 2013 D.-H. Lee, W. H. Lee, E. Choi, and H. Y.Hwang, “Subcarrier Allocation and Relay Selection for Uplink Transmission in OFDMA-Based Cognitive Radio Systems”, Proc. ICTC, pp. 485-487, Jeju, Korea, Oct. 2013 E. Choi, D.-H. Lee, M. Chen, and H. Y. Hwang, “Joint Resource Allocation and Path Selection in Network Coding-Based OFDMA Relay Networks”, Proc. ICUFN, pp. 780-784, Da Nang, Vietnam, Jul. 2013 D.-H. Lee, S.-M. Kim, “The Number of Isotones of Tightness 2 and 3”, Spring Meeting of the Korean Mathematical Society, p.68, Seoul, Korea, April. 2012 D.-H. Lee, S.-M. Kim, “Antibandwidth of Complete 3-ary Tree of Height 3”, Annual Meeting of the Korean Mathematical Society, p.114, Daegu, Korea, Oct. 2011","link":"/about/index.html"}],"posts":[{"title":"블로그를 시작합니다.","text":"이번에 Hexo로 블로그를 시작합니다. 다양한 기술과 게임 개발 관련된 글을 써볼 예정입니다.","link":"/2020/01/12/StartBlog/"}],"tags":[{"name":"hello","slug":"hello","link":"/tags/hello/"},{"name":"world","slug":"world","link":"/tags/world/"}],"categories":[{"name":"Welcome","slug":"Welcome","link":"/categories/Welcome/"}]}